
from ShahmMusic import BOT_NAME

PM_START_TEXT = """**↯︙ اهلا بك عزيزي انا بوت اسمي بلاك :

 ↯︙ يمكنني تشغيل الموسيقى والفيديو في الاتصال  ..

 ↯︙ ادعم تشغيل منصات ‹ يوتيوب • سبوتفاي › ولخ .**
"""

START_TEXT = """

"""

HELP_TEXT = f"""
<u> **-  اوامر التشغيل اتبع مايلي :**</u>
** — — — — — — — — — — 

◇︰ تشغيل أو شغل : لبدء تشغيل الاغاني .

◇︰ بينج : لقياس سرعة النت في البوت .

◇︰ أوامر القناة : تشغيل + أسم الأغنية  .

◇︰ كتم او مؤقت : لكتم الأغنية الحالية .

◇︰ كمل : لألغاء كتم الاغنية الحالية .

◇︰ تخطي : لتخطي الأغنية الحالية .

◇︰ ايقاف : لايقاف تشغيل الأغنية الحالية .**
"""

HELP_SUDO = f"""
<u> **-  اوامر التفعيل اتبع مايلي : **</u>
**— — — — — — — — — —

‹ طريقه تفعيل البوت في الكروبات والقنوات ⤈ ›

‹ Gr1 › 
 اضف البوت مع كامل الصلاحيات عدا البقاء متخفي 

‹ Gr2 › : 
افتح اتصال في المجموعة او القناة 

‹ Gr2 › :  
اكتب تشغيل + اسم الأغنية 

 - سيتم انضمام الحساب المساعد الى المحادثة الصوتية وتشغيل الاغنية التي اردتها .
- الحساب المساعد عبارة عن حساب وهمي وضيفته فقط تشغيل الموسيقى 

- لاتقم بطرده او حضره اثناء تشغيل الموسيقى يمكنك استخدام الامر

- ايقاف لانهاء تشغيل المقطع الصوتي وخروج الحساب المساعد دون مشاكل**
"""

HELP_DEV = f"""
<u> **اوامر المطور :**</u>

**◇︰  هذا الاوامر فقط لمطور البوت **

**◇︰  الامر : اذاعة و اعمل رد على الاذاعه**

**◇︰  الامر : تنظيف لمسح التخزين المؤقت للبوت**

**◇︰  الامر : مغادرة لمغادرة المساعد الكروبات**

**◇︰  الامر : مطور +اليوزر لإضافة مطور في البوت**
**◇︰  الامر : تنزيل +اليوزر لـتـنزيل مطور من البوت**
"""
